/**
* 版权所有(C) 
*
* ********
*
* @file 
* @brief
* @details
* @author HWW
* @version 1.0.0
* @date xxxx-xx-xx
* @par Description:
* @par Change History:
*
* <日期> | <版本> | <作者> | <描述>
*
* xxxx/xx/xx | 1.0.0 | HWW | 创建文件
*
*/
//------------------------------------------------------------------------------

//-----------------------------------------------------------------------------
#ifndef _MODBusCRC__H_
#define _MODBusCRC__H_
//-------------------- include files ----------------------------------------
#include "Driver.h"
//-------------------- public definitions -----------------------------------

//-------------------- public data ------------------------------------------

//-------------------- public functions -------------------------------------
uint16_t Modbus_GetCRC16(uint8_t * pucFrame, uint16_t usLen );


#endif // _MODBusCRC_H_

//-----------------------End of file------------------------------------------
/** @}*/
